Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: WinGetStyle / WinGetExStyle, ControlSetStyle / ControlSetExStyle, styles table, Win functions, Control functions
ja: WinGetStyle / WinGetExStyle、ControlSetStyle / ControlSetExStyle、スタイル表、Win関数、Control関数

source: WinGetStyle example #1 can be used to determine whether a window is disabled.
ja: WinGetStyle関数の例1は、ウィンドウが無効化されているかどうかを判断するために使用できます。

source: WinGetTitle, Win functions
ja: WinGetTitle、Win関数

source: WinHide, SetTitleMatchMode, DetectHiddenWindows, Last Found Window
ja: WinHide、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ

source: WinKill, WinWaitClose, ProcessClose, WinActivate, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, WinExist, WinActive, WinWaitActive, WinWait, GroupActivate
ja: WinKill、WinWaitClose、ProcessClose、WinActivate、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、WinExist、WinActive、WinWaitActive、WinWait、GroupActivate

source: WinMaximize, WinMinimize, Win functions, Control functions
ja: WinMaximize、WinMinimize、Win関数、Control関数

source: WinMinimize, WinMaximize, WinRestore, WinHide, WinShow, WinClose, and WinKill will act on all the group's windows.
ja: WinMinimize、WinMaximize、WinRestore、WinHide、WinShow、WinClose、WinKillはグループのすべてのウィンドウに作用する。

source: WinMinimize, WinMaximize, WinRestore, WinHide, WinShow, WinClose, and WinKill will operate upon all the group's windows.
ja: WinMinimize、WinMaximize、WinRestore、WinHide、WinShow、WinClose、WinKillは、グループのすべてのウィンドウに対して作用します。

source: WinMove no longer has special handling for the literal word DEFAULT.
ja: WinMoveでは、DEFAULTというリテラルワードに対する特別な処理を行わなくなりました。

source: WinMove, WinGetTitle, WinGetText, ControlGetText, WinGetPos, Win functions
ja: WinMove、WinGetTitle、WinGetText、ControlGetText、WinGetPos、Win関数

source: WinMoveBottom, WinSetAlwaysOnTop, Win functions, Control functions
ja: WinMoveBottom、WinSetAlwaysOnTop、Win関数、Control関数

source: WinMoveTop, WinMoveBottom, Win functions, Control functions
ja: WinMoveTop、WinMoveBottom、Win関数、Control関数

source: WinMoveTop, WinSetAlwaysOnTop, Win functions, Control functions
ja: WinMoveTop、WinSetAlwaysOnTop、Win関数、Control関数

source: WinSetStyle / WinSetExStyle, ControlGetStyle / ControlGetExStyle, styles table, Win functions, Control functions
ja: WinSetStyle / WinSetExStyle、ControlGetStyle / ControlGetExStyle、スタイル表、Win関数、Control関数

source: WinSetTitle and WinMove now use parameter order consistent with other Win functions; i.e. WinTitle, WinText, ExcludeTitle, ExcludeText are always grouped together (at the end of the parameter list), to aide memorisation.
ja: WinSetTitleと WinMoveは、他のWin関数と同じパラメータ順序を使用します。つまり、WinTitle、WinText、ExcludeTitle、ExcludeTextは、常に一緒に（パラメータリストの最後に）まとめられ、記憶に残りやすくなっています。

source: WinSetTitle, WinGetClass, WinGetText, ControlGetText, WinGetPos, Win functions
ja: WinSetTitle、WinGetClass、WinGetText、ControlGetText、WinGetPos、Win関数

source: WinSetTransColor, Win functions, Control functions
ja: WinSetTransColor、Win関数、Control関数

source: WinSetTransColor, WinGetTransparent, Win functions, Control functions
ja: WinSetTransColor、WinGetTransparent、Win関数、Control関数

source: WinSetTransparent treats "" as "Off" rather than 0 (which would make the window invisible and unclickable).
ja: WinSetTransparentは、""を0ではなく "Off"として扱います（ウィンドウが見えなくなり、クリックできなくなります）。

source: WinSetTransparent, Win functions, Control functions
ja: WinSetTransparent、Win関数、Control関数

source: WinSetTransparent, WinGetTransColor, Win functions, Control functions
ja: WinSetTransparent、WinGetTransColor、Win関数、Control関数

source: WinShow, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, Win functions
ja: WinShow、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、Win関数

source: WinWait, WinWaitClose, WinWaitActive and WinWaitNotActive return non-zero if the wait finished (timeout did not expire).
ja: WinWait、WinWaitClose、WinWaitActive、WinWaitNotActiveは、待ちが終了した場合（タイムアウトが終了しなかった場合）、非ゼロを返します。

source: Window groups are more advanced than this function, so consider using them for more features and flexibility.
ja: ウィンドウ・グループは、この機能よりも高度なものなので、より多くの機能と柔軟性を求める場合は、ウィンドウ・グループの使用を検討してください。

source: Write: Writes a string of characters to the file and advances the file pointer.
ja: Write：文字列をファイルに書き込み、ファイルポインタを進める。

source: WriteNumType: Writes a number to the file and advances the file pointer.
ja: WriteNumType：ファイルに数値を書き込み、ファイルポインタを進める。

source: XDebugClient is a simple open-source front-end DBGp client based on the .NET Framework 2.0.
ja: XDebugClientは、.NET Framework 2.0をベースにしたシンプルなオープンソースのフロントエンドDBGpクライアントです。

source: __Enum: Enumerates array elements.
ja: __Enum：配列の要素を列挙します。

source: __Enum: Enumerates key-value pairs.
ja: __Enum：キーとバリューのペアを列挙します。

source: __Item: Retrieves or sets the value of a key-value pair.
ja: __Item：キーと値のペアの値を取得または設定します。

source: __Item: Retrieves or sets the value of an array element.
ja: __Item：配列の要素の値を取得または設定します。

source: __Item: Retrieves the GuiControl object associated with the specified name, text, ClassNN or HWND.
ja: __Item：指定された名前、テキスト、ClassNN、HWND に関連するGuiControl オブジェクトを取得します。

source: __New: Allocates or reallocates the buffer and optionally fills it.
ja: __New：バッファの割り当てまたは再割り当てを行い、オプションでバッファを埋めます。

source: __New: Appends items.
ja: __New：項目を追加します。

source: __New: Constructs a new Gui instance.
ja: __New：新しいGuiインスタンスを構築します。

source: __New: Sets items.
ja: __New：項目を設定します。

source: command line parameters, A_WorkingDir, A_ScriptDir, A_ScriptName, (...more...)
ja: コマンドラインパラメータ、A_WorkingDir、A_ScriptDir、A_ScriptName、(...more...)

source: context-sensitive hotstrings.
ja: コンテキストに応じたホットストリング

source: function object or empty string.
ja: 関数オブジェクトまたは空文字列を指定します。

source: https://www.autohotkey.com/ - multiple options are presented when you click Download.
ja: https://www.autohotkey.com/- 「ダウンロード」をクリックすると、複数のオプションが表示されます。

source: https://www.autohotkey.com/download/ - the main download links are for the current exe installer, but there are also links to the current zip package and archive of older versions.
ja: https://www.autohotkey.com/download/- 主なダウンロードリンクは現在のexeインストーラーですが、現在のzipパッケージと旧バージョンのアーカイブへのリンクもあります。

source: list of built-in variables.
ja: 組み込み変数のリスト

source: other debugging methods
ja: 他のデバッグ方法

source: unset (Optional Parameters)
ja: unset（オプション・パラメータ）

source: variables, functions
ja: 変数、関数

source: vscode-autohotkey-debug provides support for interactive debugging of v1 and v2 scripts.
ja: vscode-autohotkey-debugは v1 と v2 スクリプトのインタラクティブなデバッグをサポートします。

source: window's margin.
ja: ウィンドウのマージン

source: ClickCount, Default, Handle (replaces MenuGetHandle).
ja: ClickCount、Default、Handle（MenuGetHandleを置き換えたもの）。

source: A_InitialWorkingDir contains the working directory which was set by the process which launched AutoHotkey.
ja: A_InitialWorkingDirには、AutoHotkeyを起動したプロセスで設定された作業ディレクトリが格納されます。

source: Checkboxes do not function in this view.
ja: このビューでは、チェックボックスは機能しません。

source: ClipWait ; Wait for the clipboard to contain text.
ja: ClipWait ; クリップボードにテキストが入るのを待ちます。

source: Closures which reference the variable (if local) are also unaffected and will see only the value it had outside the loop.
ja: また、その変数を参照するクロージャ（ローカルな場合）も影響を受けず、ループの外でその変数が持っていた値だけを見ることができます。

source: ControlChooseIndex does not permit 0 for Tab controls since applications tend not to handle it.
ja: ControlChooseIndexは、アプリケーションで扱われない傾向があるため、タブコントロールの0を許可しない。

source: Critical may have been called by the thread itself or by the auto-execute thread.
ja: クリティカルは、スレッド自身または自動実行スレッドによって呼び出された可能性がある。

source: DetectHiddenWindows can be used to change this.
ja: DetectHiddenWindowsを使用することで変更可能です。

source: Escape sequences are resolved when the script loads, so only the resulting characters are considered; for example, HotIf 'x = "`t"' and HotIf 'x = "' A_Tab '"' both correspond to #HotIf x = "`t".
ja: エスケープシーケンスはスクリプトのロード時に解決されるため、結果の文字のみが考慮されます。例えば、HotIf 'x = "`t"'とHotIf 'x = "' A_Tab '"'はどちらも#HotIf x = "`t"に相当します。

source: Exception.Extra contains the key name; e.g. "Entre" from !Entre.
ja: Exception.Extraには、キー名が含まれます。例えば、!Entreの "Entre"。

source: Exception.Extra contains the prefix key.
ja: Exception.Extraにはプレフィックスキーが含まれています。

source: Global variables declared inside the function are also listed in this section.
ja: 関数内部で宣言されたグローバル変数も、このセクションにリストアップされています。

source: Name property (Func)
ja: 名前プロパティ (Func)

source: NumPut( "Int", 0 ; left
ja: NumPut( "Int", 0 ; 左

source: Optional parameters are permitted, which is useful when the function is called by more than one caller.
ja: オプションのパラメータを使用することができ、複数の呼び出し元から関数を呼び出す場合に便利です。

source: SendMessage timed out.
ja: SendMessageがタイムアウトしました。

source: SendMode can be used to make Send synonymous with SendEvent or SendPlay instead.
ja: SendModeを使用することで、SendをSendEventまたはSendPlayと同義にすることができます。

source: Static/class variables and nested classes are initialized in the order that they were defined, except when a nested class is referenced during initialization of a previous variable or class.
ja: 静的/クラス変数と ネストされたクラスは、定義された順番に初期化されます。ただし、ネストされたクラスが前の変数やクラスの初期化中に参照された場合は除きます。

source: Strings, String Encoding.
ja: 文字列、文字列のエンコード。

source: The WinTitle Parameter & the Last Found Window.
ja: WinTitleパラメータと最後に見つかったウィンドウ。

source: Threads, Destroying the GUI.
ja: スレッド、GUIを破壊します。

source: Uninitialized Variables.
ja: 未初期化変数。

source: function definitions, If, Else, Loop, While, For, Try, Catch, and Finally.
ja: function definitions, If, Else, Loop, While, For, Try, Catch, 及び Finally.

source: A_TrayMenu also returns a Menu object.
ja: A_TrayMenuは、Menu オブジェクトも返します。

source: #Requires and VerCompare
ja: #Requires および VerCompare

source: Array, Map and all user defined and built-in classes are derived from Object.
ja: Array、Map、そしてすべてのユーザー定義クラスと組み込みクラスはObjectから派生している。

source: Changing the title prevents the script from being identified as such.
ja: タイトルを変更することで、スクリプトがそのように特定されるのを防ぐことができる。

source: Compiled scripts are also affected even if a custom icon was specified at the time of compiling.
ja: コンパイル時にカスタムアイコンを指定した場合でも、コンパイル済みのスクリプトは影響を受ける。

source: ExitApp, Pause, Edit, Reload, KeyHistory, ListLines, ListVars, or ListHotkeys.
ja: ExitApp, Pause, Edit, Reload, KeyHistory, ListLines, ListVars, または ListHotkeys.

source: FileAppend ClipboardAll(), "Company Logo.clip" ; The file extension does not matter.
ja: FileAppend ClipboardAll(), "Company Logo.clip" ; ファイル拡張子は問いません。

source: Global declarations in the outer function also affect nested functions, except where overridden by an explicit declaration.
ja: 外側関数のグローバル宣言は、明示的な宣言で上書きされる場合を除き、ネストした関数にも影響します。

source: If and While already supported this.
ja: Ifと Whileは、すでにサポートしています。

source: MenuFromHandle returns an object of this type if given a menu bar handle.
ja: MenuFromHandleは、メニューバーハンドルが与えられた場合、このタイプのオブジェクトを返します。

source: SendMode can be used to make Send synonymous with SendEvent or SendPlay.
ja: SendModeを使用することで、SendをSendEventまたはSendPlayと同義にすることができます。

source: SendMode can be used to make Send synonymous with SendInput or SendPlay.
ja: SendModeを使用することで、SendをSendInputやSendPlayと同義にすることができます。

source: SetWorkingDir has no effect on #DllLoad because #DllLoad is processed before the script begins executing.
ja: SetWorkingDirは、スクリプトの実行を開始する前に#DllLoadが処理されるため、#DllLoadには影響しません。

source: SetWorkingDir has no effect on #Include because #Include is processed before the script begins executing.
ja: SetWorkingDirは、スクリプトの実行を開始する前に#Includeが処理されるため、#Includeに影響を与えません。

source: Special Keys
ja: 特殊キー

source: TargetError and OSError may be thrown under other conditions.
ja: TargetErrorおよびOSErrorは、他の条件下でもスローされることがある。

source: WinGetText is affected in the same way as other functions, but it always uses the slow mode to retrieve text.
ja: WinGetTextは他の関数と同じように影響を受けるが、テキストを取得するために常にスローモードを使用する。

source: comma performance.
ja: コンマのパフォーマンス。

source: A_LastError is set unconditionally, and can be inspected after an exception is caught/suppressed.
ja: A_LastErrorは無条件に設定され、例外が捕捉/抑制された後に検査することができます。

source: Float keys are automatically converted to String.
ja: Floatキーは自動的に String に変換されます。

source: GetKeyName can be used to retrieve the standard spelling of a key name.
ja: GetKeyNameを使用して、キー名の標準的な綴りを取得することができます。

source: Global variables are visible in the "global scope" (that is, outside of functions), and can be read by functions by default, but must be declared if they are to be assigned a value inside a function.
ja: グローバル変数は、「グローバルスコープ」（つまり関数の外側）で見ることができ、デフォルトでは関数から読み込むことができますが、関数内で値を代入する場合は宣言する必要があります。

source: Gui.Add() returns a GuiControl object, which has methods and properties which replace the GuiControl and GuiControlGet commands.
ja: Gui.Add()はGuiControlオブジェクトを返し、GuiControlとGuiControlGetコマンドに代わるメソッドとプロパティを持っています。

source: Gui.Submit() returns a new associative array using the control names as keys.
ja: Gui.Submit()は、コントロール名をキーとする新しい連想配列を返します。

source: NumGet or StrGet can be used to retrieve data from the buffer.
ja: NumGetまたはStrGetを使用して、バッファからデータを取得することができます。

source: OTB is supported by all modes.
ja: OTBは全モードで対応しています。

source: ProcessExist can also be used to discover a PID.
ja: ProcessExistは、PIDを発見するために使用することもできます。

source: Send, SendInput, SendPlay, SendEvent and ControlSend can send both text and key combinations, or keys which don't produce text.
ja: Send、SendInput、SendPlay、SendEvent、ControlSendは、テキストとキーの組み合わせ、またはテキストを生成しないキーの両方を送信できます。

source: Value will still contain what the user entered.
ja: Valueには、ユーザーが入力した内容がそのまま表示されます。

source: Variadic calls are permitted.
ja: 変則的な呼び出しが可能です。

source: GetKeyName can be used to retrieve the normalized name.
ja: GetKeyNameを使用すると、正規化された名前を取得することができます。

source: InputBoxObj.Value will still contain what the user entered.
ja: InputBoxObj.Valueには、ユーザが入力した値がそのまま格納されます。

source: StrCompare was added for comparing strings using any mode.
ja: 任意のモードで文字列を比較できるStrCompareを追加しました。

source: position and sizing of controls.
ja: 位置とサイズの制御

source: Buttons do not obey custom colors.
ja: ボタンはカスタムカラーに従わない。

source: Gui and GuiControl objects have a Hwnd property and therefore can be used directly in WinTitle.
ja: Guiと GuiControlオブジェクトはHwndプロパティを持っているので、WinTitleで直接使うことができます。

source: LV.ModifyCol(3, "Integer") ; For sorting, indicate that the Size column is an integer.
ja: LV.ModifyCol(3, "Integer") ; ソートのため、Size列が整数であることを示す。

source: Local variables are visible only inside the function which created them.
ja: ローカル変数は、それを作成した関数の内部でのみ見ることができます。

source: Base may be set within the object literal, but all other properties are set as own value properties, potentially overriding properties inherited from the base object.
ja: ベースはオブジェクト・リテラル内で設定することができるが、他のすべてのプロパティは独自の値プロパティとして設定され、ベース・オブジェクトから継承されたプロパティをオーバーライドする可能性がある。

source: FileRead already ignored this character, so is not affected by this issue.
ja: FileReadはすでにこの文字を無視しているため、本問題の影響は受けません。

source: command line switches and syntax.
ja: コマンドラインスイッチとシンタックス

source: Length is now a property.
ja: Lengthがプロパティになりました。

source: A_ScreenDPI contains the system's current DPI.
ja: A_ScreenDPIは、システムの現在の DPI を含んでいます。

source: CalloutNumber: Receives the Number of the RegEx callout.
ja: CalloutNumber：RegEx コールアウトの番号を受け取ります。

source: Copy the code into a file. It's usually best to create a new file, so existing code won't interfere with the example code.
ja: コードをファイルにコピーします。既存のコードがサンプルコードに干渉しないように、通常は新しいファイルを作成するのがベストです。

source: Download the code as a file. If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the ↓ button which appears in the top-right of the code block when you hover your mouse over it.
ja: コードをファイルとしてダウンロードします。ブラウザが対応している場合、コードブロックにマウスを乗せると右上に表示される↓ボタンをクリックすると、任意のコードブロック（上記のようなもの）をスクリプトファイルとしてダウンロードすることができます。

source: Download: Binary; Source Code (also see SharpDevelop, Dockpanel Suite and Advanced TreeView.)
ja: ダウンロード： バイナリ | ソースコード(SharpDevelop、Dockpanel Suite、Advanced TreeViewもご覧ください。)

source: Download: See DBGp plugin for Notepad++.
ja: ダウンロード： Notepad++のDBGpプラグインをご覧ください。

source: FoundPos: Receives the position of the current potential match.
ja: FoundPos：現在のマッチ候補の位置を受け取る。

source: Haystack: Receives the Haystack passed to RegExMatch or RegExReplace.
ja: Haystack：RegExMatch または RegExReplace に渡されたHaystackを受け取ります。

source: IsObject can be used to determine if a value is an object:
ja: IsObjectは、値がオブジェクトであるかどうかを判定するために使用できます：

source: Known limitation: Each time a COM object is wrapped, a new wrapper object is created.
ja: 既知の制限事項：COMオブジェクトがラップされるたびに、新しいラッパーオブジェクトが作成されます。

source: Known limitation: This function cannot differentiate between two keys which share the same virtual key code, such as Left and NumpadLeft.
ja: 既知の制限事項：この機能は、LeftとNumpadLeftのように、同じ仮想キーコードを共有する2つのキーを区別することはできません。

source: Match: Receives a RegExMatchInfo object containing information about the match so far.
ja: Match：これまでのマッチに関する情報を含むRegExMatchInfoオブジェクトを受け取る。

source: NeedleRegEx: Receives the NeedleRegEx passed to RegExMatch or RegExReplace.
ja: NeedleRegEx：RegExMatchまたはRegExReplaceに渡されたNeedleRegExを受け取る。

source: Note: "AStr" and "WStr" are equally valid for parameters and the function's return value.
ja: 注：「AStr」および「WStr」は、パラメータおよび関数の戻り値に対して同様に有効です。

source: Note: File Mapping must be configured.
ja: 注：ファイルマッピングは必ず設定する必要があります。

source: Run the file: Once you have the code in a script (.ahk) file, running it is usually just a case of double-clicking the file; but there are other methods.
ja: ファイルを実行します。ファイルの実行：コードをスクリプト（.ahk）ファイルにまとめたら、通常はそのファイルをダブルクリックするだけで実行できるのですが、他の方法もあります。

source: Send may have no effect if the active window is running with administrative privileges and the script is not.
ja: アクティブウィンドウが管理者権限で実行され、スクリプトが管理者権限で実行されていない場合、送信しても効果がない場合があります。

source: ULT: Specifies a case transformation to apply to a string value -- Upper, Lower or Title.
ja: ULT：文字列の値に適用する大文字と小文字の変換を指定する --Upper、Lower、Title。

source: Unicode: IniRead and IniWrite rely on the external functions GetPrivateProfileString and WritePrivateProfileString to read and write values.
ja: ユニコード：IniReadとIniWriteは、値の読み書きに外部関数GetPrivateProfileStringとWritePrivateProfileStringに依存しています。

source: Windows 2000: The retrieved value is always 0.
ja: Windows 2000：取得される値は常に 0 です。

source: EventName should be replaced with the name of whatever event the function should handle.
ja: EventNameは、その関数が処理すべきイベントの名前に置き換える必要があります。

source: != is now always case-insensitive, like =, while !== has been added as the counterpart of ==.
ja: !=は =と同様に常に大文字と小文字を区別するようになり、!==は ==と対になるものとして追加された。

source: "," would divide the string based on every occurrence of a comma.
ja: ","は、カンマが出現するたびに文字列を分割する。

source: "MyDLL\MyFunction" (the file extension ".dll" is the default when omitted).
ja: "MyDLL\MyFunction"（ファイル拡張子".dll "は省略時のデフォルトです）。

source: "Off" (case-insensitive) or an empty string may be specified to completely turn off transparency for a window.
ja: "Off"（大文字小文字を区別しません）または空の文字列を指定すると、ウィンドウの透明度を完全にオフにすることができます。

source: "Off" or 0 (False):
ja: "Off" または 0 (False):

source: "On" or 1 (True):
ja: "On" または 1 (True):

source: ##:: would create a hotkey like the above, but which activates only if you are also holding the Windows key.
ja: ##::は、上記のようなホットキーを作成しますが、Windowsキーも保持している場合にのみ有効です。

source: #:: would create a hotkey activated by the hash key, or whatever combination is associated with that symbol (on the US layout, it's Shift+3).
ja: #::は、ハッシュキー又はその記号に関連する組み合わせで起動するホットキーを作成することができます。（USレイアウトでは Shift+3）。

source: #DllLoad [FileOrDirName]: Loads a DLL or EXE file before the script starts executing.
ja: #DllLoad [FileOrDirName]：スクリプトの実行を開始する前にDLLまたはEXEファイルをロードします。

source: $ (use hook) prevents unintentional loops when sending keys, and in some instances makes the hotkey more reliable.
ja: $（use hook）は、キー送信時の意図しないループを防止し、場合によってはホットキーの信頼性を高めることができます。

source: &Open is included only if A_AllowMainWindow is 1 when AddStandard is called (in that case, add 1 to the positions shown in the third column).
ja: AddStandardを呼び出したときにA_AllowMainWindowが1の場合のみ、&Openが含まれます（その場合、3列目に示す位置に1を追加します）。

source: &var (address-of) has been replaced with StrPtr(var) and ObjPtr(obj) to more clearly show the intent and enhance error checking.
ja: &var(address-of) がStrPtr(var)とObjPtr(obj)に置き換えられ、より明確に意図を示し、エラーチェックを強化しました。

source: &var is now the reference operator, which is used with all ByRef and OutputVar parameters to improve clarity and flexibility (and make other language changes possible).
ja: &varは参照演算子になり、すべてのByRefと OutputVar パラメータで使用され、明快さと柔軟性が向上しました（他の言語の変更も可能になります）。

source: ',' (a comma) would divide the string based on every occurrence of a comma.
ja: ','（カンマ）は、カンマが出現するたびに文字列を分割することになります。

source: ("0xA") + 1 and ("0x" Chr(65)) + 1 produce 11 instead of failing.
ja: ("0xA") + 1と ("0x" Chr(65)) + 1は失敗ではなく11を生成します。

source: *.* or * matches all files.
ja: *.*と*は、全てのファイルにマッチします。

source: *. matches files without an extension.
ja: *.は、拡張子がないファイルにマッチします。

source: *.htm matches files with the extension .htm, .html, etc.
ja: *.htmは、.htmや.htmlなどの拡張子を持つファイルにマッチします。

source: */ can now be placed at the end of a line to end a multi-line comment, to resolve a common point of confusion relating to how /* */ works in other languages.
ja: */ を行末に置いて複数行のコメントを終了できるようになり、他の言語での /* */ の動作に関する共通の混乱点を解決しました。

source: * (wildcard) allows the hotkey to fire even if you are holding modifier keys that the hotkey doesn't include symbols for.
ja: *(ワイルドカード）により、ホットキーに記号が含まれていない修飾キーを押していても、ホットキーが発火するようになります。

source: * matches all folders.
ja: *は、すべてのフォルダにマッチします。

source: *report* matches any filename containing the word "report".
ja: *report*は、ファイル名に"report"を含むあらゆるファイルにマッチします。

source: *report* matches any folder name containing the word "report".
ja: *report*は、フォルダ名に"report"の語を含むすべてのフォルダにマッチします。

source: +Owner can be immediately followed by the HWND of any top-level window.
ja: +Ownerは、任意のトップレベルウィンドウのHWNDにすぐに続くことができます。

source: -1 sets it to the opposite of its current state
ja: -1では、現在の状態とは逆の状態に設定されます

source: -1 toggles the setting (sets it to the opposite of its current state)
ja: -1 は、設定を現在とは逆に切り替えます

source: -1: Changes to the opposite of its previous state (On or Off).
ja: -1：以前の状態（オンまたはオフ）と逆の状態に変化する。

source: -1: Toggles the pause state of the underlying thread.
ja: -1：基礎となるスレッドの一時停止状態を切り替えます。

source: .Clone(): Returns a copy of the array.
ja: .Clone()：配列のコピーを返します。

source: .MaxIndex(n): Returns the upper bound of the nth dimension.
ja: .MaxIndex(n)：n次元の上限値を返す。

source: .MinIndex(n): Returns the lower bound of the nth dimension.
ja: .MinIndex(n)：n次元目の下界を返します。

source: .__Enum(): Not typically called by script; allows for-loops to be used with SafeArrays.
ja: .__Enum()：SafeArraysでforループを使用することができます。

source: .cur (not yet supported)
ja: .cur（未対応）

source: // now throws an exception if given a floating-point number.
ja: // は、浮動小数点数が与えられた場合、例外を投げるようになりました。

source: 0 or False turns off the setting
ja: 0またはFalseで設定をオフにしま

source: 0 or False:
ja: 0 または False:

source: 0 or False: Re-enables the hotkeys and hotstrings that were disable above.
ja: 0 または False：上記で無効にしたホットキーとホットストリングを再度有効にします。

source: 0 or False: Unpauses the underlying thread.
ja: 0 または False：基礎となるスレッドの一時停止を解除します。

source: 1 or True turns on the setting
ja: 1またはTrueで設定をオンにします

source: 1 or True:
ja: 1 または True:

source: 1 or True: Marks the thread beneath the current thread as paused so that when it resumes, it will finish the function it was running (if any) and then enter a paused state.
ja: 1 または True：現在のスレッドの下にあるスレッドを一時停止状態としてマークし、再開時に実行中の関数があればそれを終了させ、一時停止状態に入るようにします。

source: 1 or True: Marks the underlying thread as paused.
ja: 1またはTrue: 基礎となるスレッドを一時停止としてマークします。

source: 1 or True: Suspends all hotkeys and hotstrings except those explained the Remarks section.
ja: 1 または True：備考セクションで説明した以外のすべてのホットキーと ホットストリングを一時停止します。

source: 1: Suppress the default error dialog and any remaining error callbacks.
ja: 1：デフォルトのエラーダイアログと残りのエラーコールバックを抑制します。

source: ::btw::by the way and ::btw::
ja: ::btw::by the way および ::btw::
